---
kind: method
id: M:Autodesk.Revit.DB.FailureMessageAccessor.Dispose
source: html/b0273bec-b53c-0157-24fe-5c294189c168.htm
---
# Autodesk.Revit.DB.FailureMessageAccessor.Dispose Method

Releases all resources used by the FailureMessageAccessor

## Syntax (C#)
```csharp
public void Dispose()
```